## Nano Degree Club - Assignment 2
### Author : Muhammad Bilal
### Submitted to : Sir Umair Baig

## **Task 01:**
Consider the following lists:

In [1]:
import numpy as np
import pandas as pd

country = ['Netherland', 'Germany', 'Peru', 'Israel', 'Madagascar']
year = [2002, 2002, 1957, 2007, 1967]
population = [16122830.0, np.nan, 9146100.0, 6426679.0, 6334556.0]
continent = ['Europe', 'europe', 'Americas', 'asia', 'Africa']

1. Create a Dataframe object which contains all the lists values as Series. The final DataFrame should be named as country_info, containing 4 columns and 5 rows.

In [5]:
country_info = pd.DataFrame({'country':country,'year':year,'population':population,'continent':continent})
country_info.head()

      country  year  population continent
0  Netherland  2002  16122830.0    Europe
1     Germany  2002         NaN    europe
2        Peru  1957   9146100.0  Americas
3      Israel  2007   6426679.0      asia
4  Madagascar  1967   6334556.0    Africa

2. Delete the rows which contains missing values

In [9]:
country_info.dropna(inplace=True)
country_info.head()

      country  year  population continent
0  Netherland  2002  16122830.0    Europe
2        Peru  1957   9146100.0  Americas
3      Israel  2007   6426679.0      asia
4  Madagascar  1967   6334556.0    Africa

3. Capitalize all the continents in a continent column.

In [10]:
country_info.continent = country_info.continent.str.upper()
country_info.head()

      country  year  population continent
0  Netherland  2002  16122830.0    EUROPE
2        Peru  1957   9146100.0  AMERICAS
3      Israel  2007   6426679.0      ASIA
4  Madagascar  1967   6334556.0    AFRICA

4. Get the length of each country's names.

In [18]:
country_info.country.str.len()

0    10
2     4
3     6
4    10
Name: country, dtype: int64

## **Task 02:**
Consider the following lists:

In [19]:
country = ['Netherland', 'Germany', 'Peru', 'Israel', 'Madagascar']
gdp_per_cap = [33724.757780, 30035.801980, 4245.256698, 25523.277100, 1634.047282]

1. Create a Dataframe object which contains all the lists values as Series. The final DataFrame should be named as country_gdp, containing 2 columns and 5 rows.

In [27]:
country_gdp = pd.DataFrame({'country':country,'gdp_per_cap':gdp_per_cap})
country_gdp.head()

      country   gdp_per_cap
0  Netherland  33724.757780
1     Germany  30035.801980
2        Peru   4245.256698
3      Israel  25523.277100
4  Madagascar   1634.047282

2. Concatenate the two dataframes: country_info and country_gdp with axis=0 and name it concat_data.

In [36]:
concat_data = pd.merge(country_info,country_gdp,on='country',how='outer')
concat_data

      country    year  population continent   gdp_per_cap
0  Netherland  2002.0  16122830.0    EUROPE  33724.757780
1        Peru  1957.0   9146100.0  AMERICAS   4245.256698
2      Israel  2007.0   6426679.0      ASIA  25523.277100
3  Madagascar  1967.0   6334556.0    AFRICA   1634.047282
4     Germany     NaN         NaN       NaN  30035.801980

3. Check if there are any null values in concat_data.

In [38]:
concat_data.isnull()

   country   year  population  continent  gdp_per_cap
0    False  False       False      False        False
1    False  False       False      False        False
2    False  False       False      False        False
3    False  False       False      False        False
4    False   True        True       True        False

4. Find the total number of missing values in each column. hint: Use .isnull() and .sum() functions

In [39]:
concat_data.isnull().sum()

country        0
year           1
population     1
continent      1
gdp_per_cap    0
dtype: int64